"use strict";
/*********************************  类型 + [] *********************************/
var numArray;
numArray = [1, 2, 2, 2];
// numArray=[1,'3'] //数组中不允许出现除number外的其他类型的值
// numArray.push('k') // 也会报错，只能push number类型的值
/*********************************  数组泛型  *********************************/
var genericArray;
genericArray = [1, 2, 3, 4];
/**
 * NumArray 表示索引是数字，值也是数字 的数组
 * 不过通常不这么做，因为麻烦
 * 在类数组中我们这么定义接口
 */
var ifArray = [1, 2, 3];
/*********************************  常用表示  *********************************/
var anyArray = [1, '3', { a: 1 }];
